
package com.hyc.www.controller.constant;

/**
 * request中method的枚举常量
 *
 * @program XHotel
 * @description
 */

public enum Methods {

    /**
     * 显示主页
     */
    INDEX_VIEW,

    /*
     **************************************************************
     *               用户
     **************************************************************
     */
    /**
     * 执行登陆方法
     */
    LOGIN_DO,
    /**
     * 执行注册方法
     */
    REGIST_DO,

    /**
     * 执行退出登陆方法
     */
    LOGOUT_DO,

    /*
     **************************************************************
     *               通用操作方法
     **************************************************************
     */
    /**
     * 添加
     */
    ADD_DO,
    /*
     * 删除
     */
    DELETE_DO,
    /**
     * 更新
     */
    UPDATE_DO,

    /**
     * 查找
     */
    FIND_DO;


}

